// Напишите программу, которая на вход принимает число и выводит его квадрат

Console.Clear();

Console.WriteLine("Введите число: ");

int num = int.Parse(Console.ReadLine());

int sqr = num * num;

Console.Write("Кdадрат числа " + num + " = " + sqr);




